Revit 2024 API
ParameterTypeId.ElementLockedParam Property
 "Locked"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId ElementLockedParam { get; }
Visual Basic
Public Shared ReadOnly Property ElementLockedParam As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ ElementLockedParam {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace